<?php
// +----------------------------------------------------------------------
// | 请求方式的抽象类
// +----------------------------------------------------------------------
// | author    武安y<yaobin24@126.com>
// +----------------------------------------------------------------------
// | note  熟悉abstract的操作：
// |  abstract类：不可以被实例化(最浅显的理解：new 一个对象)；
// |      可以私有的，非abstract方法(需实现)，abstract方法（只能继承实现，且必须实现）
// +----------------------------------------------------------------------
// | Date       2018/12/14 Time: 上午10:40
// +----------------------------------------------------------------------

namespace Library;


abstract class Mode
{
    //获取请求方式
    abstract public function getMode();

    //控制台请求方式
    abstract public function cliMode();

    //fpm请求方式
    abstract public function fpmMode();

}