<?php
// +----------------------------------------------------------------------
// | Cli显示类型的工厂类
// +----------------------------------------------------------------------
// | author    武安y<yaobin24@126.com>
// +----------------------------------------------------------------------
// | note
// +----------------------------------------------------------------------
// | Date       2018/12/18 Time: 下午8:27
// +----------------------------------------------------------------------

namespace Transform\TransformFactory;



use Transform\BaseTransform\CliTransform;

class CliFactory implements Factory
{
    public function create()
    {
        return new CliTransform();
    }

}